class Hanja8 {
constructor(){
this.Hno = 43;
this.H = ["一", "二", "三", "四", "五", "六", "七", "八", "九", "十", "大", "中", "小", "韓", "兄", "弟", "東", "西", "南", "北", "國", "學", "校", "父", "母", "王", "室", "人", "敎", "門", "萬", "民", "先", "山", "生", "外", "軍", "寸", "長", "靑", "白", "女", "年"];
this.W = [1, 2, 3, 5, 4, 4, 2, 2, 2, 2, 3, 4, 3, 17, 5, 7, 8, 6, 9, 5, 11, 16, 10, 4, 5, 4, 9, 2, 11, 8, 13, 5, 6, 3, 5, 5, 9, 3, 8, 8, 5, 3, 6];
this.N = ["한 일", "두 이", "석 삼", "넉 사", "다섯 오", "여섯 육(륙)", "일곱 칠", "여덟 팔", "아홉 구", "열 십", "클 대/큰 대", "가운데 중", "작을 소", "한국 한/나라 한", "형 형", "아우 제", "동녘 동", "서녘 서", "남녘 남", "북녘 북", "나라 국", "배울 학", "학교 교", "아버지 부/아비 부", "어머니 모", "임금 왕", "집 실", "사람 인", "가르칠 교", "문 문", "일 만 만", "백성 민", "먼저 선", "메 산", "날 생", "바깥 외", "군사 군", "마디 촌", "길 장/어른 장", "푸를 청", "흰 백", "여자 녀(여)", "해 년(연)"];
this.Nk = ["한", "두", "석", "넉", "다섯", "여섯 ", "일곱", "여덟", "아홉", "열", "클", "가운데", "작을", "한국", "형", "아우", "동녘", "서녘", "남녘", "북녘", "나라", "배울", "학교", "아버지", "어머니", "임금", "집", "사람", "가르칠", "문", "일 만", "백성", "먼저", "메", "날", "바깥", "군사", "마디", "길", "푸를", "흰", "여자 ", "해 "];
this.Nh = ["일", "이", "삼", "사", "오", "육(륙)", "칠", "팔", "구", "십", "대", "중", "소", "한", "형", "제", "동", "서", "남", "북", "국", "학", "교", "부", "모", "왕", "실", "인", "교", "문", "만", "민", "선", "산", "생", "외", "군", "촌", "장", "청", "백", "녀(여)", "년(연)"];
}
}